Config/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторНачислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьНалогообложенияНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Comment>Код по классификатору видов экономической деятельности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Comment>Наименование по классификатору видов экономической деятельности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КППИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/Корреспонденты/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ УНИВЕРСАЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СведенияОЮрФизЛице(Контрагент, Период = Неопределено) Экспорт
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Данные = Новый Структура("НаименованиеПолное,СтранаРегистрации,НалоговыйНомерВСтранеРегистрации,НаименованиеСокращенное,НалоговыйНомер");
		Данные.Вставить("СсылкаНаОбъект", Контрагент);
		Если ЗначениеЗаполнено(Период) Тогда
			Данные.Вставить("Период", Период);
		КонецЕсли;
		Справочники.Контрагенты.ПолучитьДанныеКонтрагента(Данные);
		Данные.Вставить("НалоговыйНомерВСтранеРегистрации", Данные.НалоговыйНомер);
		
		ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ВидКонтрагента, ЮридическоеФизическоеЛицо");
		Данные.Вставить("ЮридическоеФизическоеЛицо", ДанныеКонтрагента.ВидКонтрагента);
		Если ДанныеКонтрагента.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Данные.Вставить("НаименованиеДляПечатныхФорм", Данные.НаименованиеПолное);
			Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты, , Период);
		Иначе
			Данные.Вставить("НаименованиеДляПечатныхФорм", Данные.НаименованиеСокращенное);
			Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица, , Период);
		КонецЕсли;
		Данные.Вставить("ЮридическийАдрес", Адрес);
		Данные.Вставить("СтранаРегистрации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКонтрагента.ЮридическоеФизическоеЛицо, "СтранаРегистрации"));
		Возврат Данные;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПроверитьОпределитьКонтрагентаЮрФизЛицо(ИНН, КПП = "", ЮрФизЛицоСсылка = Неопределено, КонтрагентСсылка = Неопределено) Экспорт
	
	Результат = Новый Структура("ЕстьДанные, Корректен, ВидКонтрагента, ИНН, КПП, ЮрФизЛицоСсылка, КонтрагентСсылка, ЭтоУказанноеЮрФизЛицо, ЭтоУказанныйКонтрагент, ЕстьКонтрагент");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) КАК ВидКонтрагента,
	|	ЮридическиеЛица.ИНН,
	|	ЮридическиеЛица.КПП,
	|	ЮридическиеЛица.Ссылка
	|ПОМЕСТИТЬ ЮрФизЛица
	|ИЗ
	|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|ГДЕ
	|	ЮридическиеЛица.ИНН = &ИНН
	|	И ЮридическиеЛица.КПП = &КПП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо),
	|	ФизическиеЛица.ИНН,
	|	"""",
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ИНН = &ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮрФизЛица.ВидКонтрагента,
	|	ЮрФизЛица.ИНН,
	|	ЮрФизЛица.КПП,
	|	ЮрФизЛица.Ссылка КАК ЮрФизЛицоСсылка,
	|	Контрагенты.Ссылка КАК КонтрагентСсылка,
	|	ВЫБОР
	|		КОГДА ЮрФизЛица.Ссылка = &ЮрФизЛицоСсылка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУказанноеЮрФизЛицо,
	|	ВЫБОР
	|		КОГДА Контрагенты.Ссылка = &КонтрагентСсылка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУказанныйКонтрагент,
	|	ВЫБОР
	|		КОГДА Контрагенты.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКонтрагент
	|ИЗ
	|	ЮрФизЛица КАК ЮрФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЮрФизЛица.Ссылка = Контрагенты.ЮридическоеФизическоеЛицо");
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("ЮрФизЛицоСсылка", ЮрФизЛицоСсылка);
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Результат.ЕстьДанные = Выборка.Количество();
	
	Если Результат.ЕстьДанные = 0 Тогда
		
		 Результат.Корректен = Истина;
	
	 ИначеЕсли Результат.ЕстьДанные = 1 И ((Выборка[0].ЭтоУказанноеЮрФизЛицо 
		 И (Выборка[0].ЭтоУказанныйКонтрагент ИЛИ КонтрагентСсылка = Неопределено)) 
		 ИЛИ НЕ Выборка[0].ЕстьКонтрагент)  Тогда
		//редактирование уже существующего
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка[0]);
		Результат.Корректен = Истина;

		
	ИначеЕсли Результат.ЕстьДанные > 0 Тогда
		
		Результат.Корректен = Ложь;

		// есть тот же самый контрагент/юрлицо
		Строки = Выборка.НайтиСтроки(Новый Структура("ЭтоУказанноеЮрФизЛицо, ЭтоУказанныйКонтрагент", Истина, Истина));
		
		Если Строки.Количество() > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Результат, Строки[0]);	
			
		Иначе
			
			СтрНетКонтрагента = Выборка.Найти(Ложь, "ЕстьКонтрагент");
			
			Если Не СтрНетКонтрагента = Неопределено Тогда
				//нашли "свободное" юрлицо с переданными ИНН, КПП
				ЗаполнитьЗначенияСвойств(Результат, СтрНетКонтрагента);
				
			Иначе
				
				Результат.ЕстьКонтрагент	= Истина;
				Результат.ЮрФизЛицоСсылка 	= ЮрФизЛицоСсылка;
				Результат.КонтрагентСсылка 	= КонтрагентСсылка;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции	

Функция ПроверитьДублиКонтрагентаЮрЛица(ИНН, КПП, КонтрагентСсылка) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП
	|	И НЕ Контрагенты.Ссылка = &Ссылка
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)");
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("Ссылка", КонтрагентСсылка);
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции	

Функция ПроверитьДублиЮрЛица(ИНН, КПП, СсылкаЮЛ) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|ГДЕ
	|	ЮридическиеЛица.ИНН = &ИНН
	|	И ЮридическиеЛица.КПП = &КПП
	|	И НЕ ЮридическиеЛица.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("Ссылка", СсылкаЮЛ);
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции	

Функция ПроверитьДублиКонтрагентаФизЛица(ФИО, ДатаРождения, КонтрагентСсылка) Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ФизическиеЛица) Тогда
		Возврат 0;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &ФИО
	|	И Контрагенты.ЮридическоеФизическоеЛицо.ДатаРождения = &ДатаРождения
	|	И НЕ Контрагенты.Ссылка = &Ссылка
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)");
	
	Запрос.УстановитьПараметр("ФИО", ФИО);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	Запрос.УстановитьПараметр("Ссылка", КонтрагентСсылка);
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции	

Функция ПроверитьДублиФизЛица(ФИО, ДатаРождения, Ссылка) Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ФизическиеЛица) Тогда
		Возврат 0;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Наименование = &ФИО
	|	И ФизическиеЛица.ДатаРождения = &ДатаРождения
	|	И НЕ ФизическиеЛица.Ссылка = &Ссылка
	|	И ФизическиеЛица.ЭтоГруппа = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ФИО", ФИО);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции	

Функция ПроверитьДублиФизЛицаПоРегДанным(ТипДанных, ЗначениеДанных, Ссылка, Источник = "Контрагенты", Уточнение = ".ЮридическоеФизическоеЛицо") Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ФизическиеЛица) Тогда
		Возврат 0;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник." + Источник + " КАК Контрагенты
	|ГДЕ
	|	Контрагенты" + СокрЛП(Уточнение) + "." + ТипДанных + " = &ЗначениеДанных
	|	И НЕ Контрагенты.Ссылка = &Ссылка
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ЗначениеДанных", ЗначениеДанных);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции

// Возвращаем подбираем список физлиц с похожим наименованием
// Параметры
//		ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица, ссылка на физлицо
//								которое уже сопоставлено с сотрудником
//
Функция ПодобратьСписокФизЛиц(ФизическоеЛицоСсылка, Знач Фамилия, Знач Имя, Знач Отчество) Экспорт
	
	СписокФизлиц = Новый СписокЗначений;
	Фамилия  = СОКРЛП(Фамилия);
	Имя 	 = СОКРЛП(Имя);
	Отчество = СОКРЛП(Отчество);
	Наименование = Фамилия +" "+ Имя +" "+ Отчество;
	
	Если ПустаяСтрока(Наименование) Тогда
		Возврат СписокФизлиц;
	КонецЕсли;
	
	Фамилия = ВРег(Фамилия);
	Фамилия = СтрЗаменить(Фамилия, "~", "~~");
	Фамилия = СтрЗаменить(Фамилия, "%", "~%");
	Фамилия = СтрЗаменить(Фамилия, "_", "~_");
	Фамилия = СтрЗаменить(Фамилия, "[", "~[");
	Фамилия = СтрЗаменить(Фамилия, "-", "~-");
	Фамилия = СтрЗаменить(Фамилия,"Е","&");
	Фамилия = СтрЗаменить(Фамилия,"Ё","&");
	Фамилия = СтрЗаменить(Фамилия,"&","[её]");
	
	Имя = ВРег(Имя);
	Если Найти("НАТАЛЬЯ,НАТАЛИЯ", Имя) > 0 Тогда
		Имя = "НАТАЛ[ьи]Я";
	Иначе
		Имя = СтрЗаменить(Имя, "~", "~~");
		Имя = СтрЗаменить(Имя, "%", "~%");
		Имя = СтрЗаменить(Имя, "_", "~_");
		Имя = СтрЗаменить(Имя, "[", "~[");
		Имя = СтрЗаменить(Имя, "-", "~-");
		Имя = СтрЗаменить(Имя,"Е","&");
		Имя = СтрЗаменить(Имя,"Ё","&");
		Имя = СтрЗаменить(Имя,"&","[её]");
	КонецЕсли;

	///////////////////////////
	// подготовим Отчество
	Отчество = ВРег(Отчество);
	Отчество = СтрЗаменить(Отчество, "~", "~~");
	Отчество = СтрЗаменить(Отчество, "%", "~%");
	Отчество = СтрЗаменить(Отчество, "_", "~_");
	Отчество = СтрЗаменить(Отчество, "[", "~[");
	Отчество = СтрЗаменить(Отчество, "-", "~-");
	
	МассивПодстрок = Новый Массив;
	МассивПодстрок.Добавить("ИЕВИЧ");
	МассивПодстрок.Добавить("ЬЕВИЧ");
	МассивПодстрок.Добавить("ИЕВНА");
	МассивПодстрок.Добавить("ЬЕВНА");
	НетЗаменыСимволов = Истина;
	Для каждого Стр Из МассивПодстрок Цикл
		ПозицияСимвола = Найти(Отчество, Стр);
		Если ПозицияСимвола > 0 Тогда
			Отчество = Лев(Отчество,ПозицияСимвола-1) + "[иь]" + Сред(Отчество,ПозицияСимвола+1);
			НетЗаменыСимволов = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НетЗаменыСимволов Тогда
		
		МассивПодстрок = Новый Массив;
		МассивПодстрок.Добавить("ЬЯНОВИЧ");
		МассивПодстрок.Добавить("ИЯНОВИЧ");
		МассивПодстрок.Добавить("ИАНОВИЧ");
		МассивПодстрок.Добавить("ЬЯНОВНА");
		МассивПодстрок.Добавить("ИЯНОВНА");
		МассивПодстрок.Добавить("ИАНОВНА");
		Для каждого Стр Из МассивПодстрок Цикл
			ПозицияСимвола = Найти(Отчество, Стр);
			Если ПозицияСимвола > 0 Тогда
				Отчество = Лев(Отчество,ПозицияСимвола-1) + "[иь][яа]" + Сред(Отчество,ПозицияСимвола+2);
				НетЗаменыСимволов = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если НетЗаменыСимволов Тогда
		Отчество = СтрЗаменить(Отчество,"Е","&");
		Отчество = СтрЗаменить(Отчество,"Ё","&");
		Отчество = СтрЗаменить(Отчество,"&","[её]");
	КонецЕсли;
	
	// закончили подготовку Отчества
	///////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицоСсылка);
	Запрос.УстановитьПараметр("Фамилия", Фамилия);
	Запрос.УстановитьПараметр("ФамилияИмя", Фамилия + " %" + Имя);
	Запрос.УстановитьПараметр("ФамилияИмяОтчество", Фамилия + " %" + Имя + " %" + Отчество);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.Наименование
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Ссылка <> &ФизическоеЛицо
	|	И (ФизическиеЛица.Наименование ПОДОБНО &Фамилия СПЕЦСИМВОЛ ""~""
	|			ИЛИ ФизическиеЛица.Наименование ПОДОБНО &ФамилияИмя СПЕЦСИМВОЛ ""~""
	|			ИЛИ ФизическиеЛица.Наименование ПОДОБНО &ФамилияИмяОтчество СПЕЦСИМВОЛ ""~"")";
	
	МассивФизлиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокФизлиц.ЗагрузитьЗначения(МассивФизлиц);
	
	Возврат СписокФизЛиц;
	
КонецФункции

Функция ОКТМОИзАдреса(КонтактнаяИнформацияЗначенияПолей) Экспорт
	
	Результат = АдресныйКлассификатор.КодыАдреса(КонтактнаяИнформацияЗначенияПолей);
	Если Результат.Свойство("ОКТМО") Тогда
		Возврат Результат.ОКТМО;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	

Процедура НаличиеКонтрагентаПриПолученииДанныхНаСервере(Настройки, Строки, ИмяПоля = "ЕстьКонтрагент") Экспорт
	
	Если НЕ ПравоДоступа("Просмотр", метаданные.Справочники.Контрагенты) Тогда
		Возврат;
	КонецЕсли;	
	
	Ключи = Строки.ПолучитьКлючи();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Количество,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.ЮридическоеФизическоеЛицо В (&Массив)
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ЮридическоеФизическоеЛицо");
	
	Запрос.УстановитьПараметр("Массив", Ключи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			ТекСтрока = Строки.Получить(Выборка.ЮридическоеФизическоеЛицо);
			Если НЕ ТекСтрока = Неопределено Тогда
				ТекСтрока.Данные[ИмяПоля] = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура НайтиКонтрагентаЮрФизЛица(Ссылка, КонтрагентСсылка, КонтрагентСтрока) Экспорт
	
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Справочники.Контрагенты) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Представление КАК Представление
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЮридическоеФизическоеЛицо = &ЮридическоеФизическоеЛицо");
	
	Запрос.УстановитьПараметр("ЮридическоеФизическоеЛицо", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КонтрагентСсылка = Выборка.Ссылка;
		КонтрагентСтрока = "В списке контрагентов: " + Выборка.Представление;
	Иначе
		КонтрагентСтрока = "Отсутствует в списке контрагентов";
	КонецЕсли;	
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДАННЫМИ ФИЗЛИЦА

// Инициализация данных формы для редактирования документа, удостоверяющего личность
//
// Параметры:
//	Форма - управляемая форма
//	ВедущийОбъект - ссылка на объект, документ которого редактируется в форме
//
// Ограничения:
//	Форма должна содержать реквизиты
//		ДокументыФизическихЛиц
//		ДокументыФизическихЛицПрежняя
//		ДокументыФизическихЛицНоваяЗапись
// см. также ПрочитатьДокументУдостоверяющийЛичностьДляРедактированияВФорме
Процедура ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(Форма, ВедущийОбъект) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Физлицо = ВедущийОбъект;
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, "ДокументыФизическихЛиц");
	
	ЗаписьКакСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерЗаписи, МетаданныеРегистра);
	Форма.ДокументыФизическихЛицПрежняя = Новый ФиксированнаяСтруктура(ЗаписьКакСтруктура);
	
	Форма.ДокументыФизическихЛицНоваяЗапись = Ложь;
	
КонецПроцедуры

// Чтение и запись записи документа, удостоверяющего личность, подчиненного ведущему объекту 
// для редактирования документа в форме
//
// Параметры:
//	Форма - управляемая форма
//	ВедущийОбъект - ссылка на ведущий объект
//
// Ограничения:
//	Форма должна содержать реквизиты
//		ДокументыФизическихЛиц
//		ДокументыФизическихЛицПрежняя
//		ДокументыФизическихЛицНоваяЗапись
Процедура ПрочитатьДокументУдостоверяющийЛичностьДляРедактированияВФорме(Форма, ВедущийОбъект) Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ФизическиеЛица) Тогда
		Возврат;
	КонецЕсли;	

	Если НЕ Форма.Параметры.Ключ.Пустая() Тогда
		ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(Форма, ВедущийОбъект)
	КонецЕсли;
	МетаданныеРегистра = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	// Ищем последнюю запись
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрСведений.Период,
	|	РегистрСведений.ВидДокумента
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц КАК РегистрСведений
	|ГДЕ
	|	РегистрСведений.Физлицо = &ВедущийОбъект
	|	И РегистрСведений.ЯвляетсяДокументомУдостоверяющимЛичность
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрСведений.Период УБЫВ");
	Запрос.УстановитьПараметр("ВедущийОбъект", ВедущийОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	Если Выборка.Следующий() Тогда
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.ВидДокумента = Выборка.ВидДокумента;
		МенеджерЗаписи.Физлицо = ВедущийОбъект;
		МенеджерЗаписи.Прочитать();
	КонецЕсли;
	// имя реквизита формы совпадает с именем регистра
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, "ДокументыФизическихЛиц");
	
	ЗаписьКакСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерЗаписи, МетаданныеРегистра);
	Форма.ДокументыФизическихЛицПрежняя = Новый ФиксированнаяСтруктура(ЗаписьКакСтруктура);
	
	Форма.ДокументыФизическихЛицНоваяЗапись = Ложь;
	
КонецПроцедуры

// запись записи документа удостоверяющего личность, подчиненных ведущему объекту 
// см. ПрочитатьДокументУдостоверяющийЛичностьДляРедактированияВФорме
Процедура ЗаписатьДокументУдостоверяющийЛичностьПослеРедактированияВФорме(Форма, ВедущийОбъект) Экспорт
	ИмяРегистра = "ДокументыФизическихЛиц";
	МетаданныеРегистра = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ИмяИзмерения = "ФизЛицо";

	ИзменилисьДанные = Форма[ИмяРегистра].Период <> Форма[ИмяРегистра + "Прежняя"].Период;
	Если НЕ ИзменилисьДанные Тогда
		ИзменилисьДанные = ИзменилисьДанные ИЛИ 
		(ВедущийОбъект <> Форма[ИмяРегистра + "Прежняя"][ИмяИзмерения] И 
		ЗначениеЗаполнено(Форма[ИмяРегистра + "Прежняя"][ИмяИзмерения]));
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		ИзменилисьДанные = ИзменилисьДанные ИЛИ 
		(Форма[ИмяРегистра].ВидДокумента <> Форма[ИмяРегистра + "Прежняя"].ВидДокумента);
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		Для Каждого Поле Из МетаданныеРегистра.Ресурсы Цикл
			ИзменилисьДанные = ИзменилисьДанные ИЛИ (Форма[ИмяРегистра][Поле.Имя] <> Форма[ИмяРегистра + "Прежняя"][Поле.Имя]);
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		Для Каждого Поле Из МетаданныеРегистра.Реквизиты Цикл
			ИзменилисьДанные = ИзменилисьДанные ИЛИ (Форма[ИмяРегистра][Поле.Имя] <> Форма[ИмяРегистра + "Прежняя"][Поле.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	Если ИзменилисьДанные Тогда
		// пишем новое состояние записи
		МенеджерЗаписи = Форма.РеквизитФормыВЗначение(ИмяРегистра);
		МенеджерЗаписи[ИмяИзмерения] = ВедущийОбъект;
		МенеджерЗаписи["ЯвляетсяДокументомУдостоверяющимЛичность"] = Истина;
		// если нужно сохранить старую запись, то установим режим замещения - Ложь
		Если Форма[ИмяРегистра + "НоваяЗапись"] Тогда
			НоваяЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,  МенеджерЗаписи);
			НоваяЗапись.Записать();
		Иначе
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//ВОДИТЕЛЬСКОЕ УДОСТОВЕРЕНИЕ

// Инициализация данных формы для редактирования водительского удостоверения
//
// Параметры:
//	Форма - управляемая форма
//	ВедущийОбъект - ссылка на объект, документ которого редактируется в форме
//
// Ограничения:
//	Форма должна содержать реквизиты
//		ВодительскоеУдостоверениеФизическогоЛица
//		ВодительскоеУдостоверениеФизическогоЛицаПрежняя
//		ВодительскоеУдостоверениеФизическогоЛицаНоваяЗапись
// см. также ПрочитатьВодительскоеУдостоверениеДляРедактированияВФорме
Процедура ИнициализироватьВодительскоеУдостоверениеДляРедактированияВФорме(Форма, ВедущийОбъект) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Физлицо = ВедущийОбъект;
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, "ВодительскоеУдостоверениеФизическогоЛица");
	
	ЗаписьКакСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерЗаписи, МетаданныеРегистра);
	Форма.ВодительскоеУдостоверениеФизическогоЛицаПрежняя = Новый ФиксированнаяСтруктура(ЗаписьКакСтруктура);
	
	Форма.ВодительскоеУдостоверениеФизическогоЛицаНоваяЗапись = Ложь;
	
КонецПроцедуры

// Чтение и запись записи водительского удостоверения, подчиненного ведущему объекту 
// для редактирования документа в форме
//
// Параметры:
//	Форма - управляемая форма
//	ВедущийОбъект - ссылка на ведущий объект
//
// Ограничения:
//	Форма должна содержать реквизиты
//		ВодительскоеУдостоверениеФизическогоЛица
//		ВодительскоеУдостоверениеФизическогоЛицаПрежняя
//		ВодительскоеУдостоверениеФизическогоЛицаНоваяЗапись
Процедура ПрочитатьВодительскоеУдостоверениеДляРедактированияВФорме(Форма, ВедущийОбъект) Экспорт
	Если НЕ Форма.Параметры.Ключ.Пустая() Тогда
		ИнициализироватьВодительскоеУдостоверениеДляРедактированияВФорме(Форма, ВедущийОбъект)
	КонецЕсли;
	МетаданныеРегистра = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	// Ищем последнюю запись
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрСведений.Период,
	|	РегистрСведений.ВидДокумента
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц КАК РегистрСведений
	|ГДЕ
	|	РегистрСведений.Физлицо = &ВедущийОбъект
	|	И РегистрСведений.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрСведений.Период УБЫВ");
	Запрос.УстановитьПараметр("ВедущийОбъект", ВедущийОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	Если Выборка.Следующий() Тогда
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.ВидДокумента = Выборка.ВидДокумента;
		МенеджерЗаписи.Физлицо = ВедущийОбъект;
		МенеджерЗаписи.Прочитать();
	КонецЕсли;
	// имя реквизита формы не совпадает с именем регистра
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, "ВодительскоеУдостоверениеФизическогоЛица");
	
	ЗаписьКакСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерЗаписи, МетаданныеРегистра);
	Форма.ВодительскоеУдостоверениеФизическогоЛицаПрежняя = Новый ФиксированнаяСтруктура(ЗаписьКакСтруктура);
	
	Форма.ВодительскоеУдостоверениеФизическогоЛицаНоваяЗапись = Ложь;
	
КонецПроцедуры

// запись записи водительского удостоверения, подчиненных ведущему объекту 
// см. ПрочитатьВодительскоеУдостоверениеДляРедактированияВФорме
Процедура ЗаписатьВодительскоеУдостоверениеПослеРедактированияВФорме(Форма, ВедущийОбъект) Экспорт
	ИмяРеквизита = "ВодительскоеУдостоверениеФизическогоЛица";
	
	ИмяРегистра = "ДокументыФизическихЛиц";
	МетаданныеРегистра = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ИмяИзмерения = "ФизЛицо";

	ИзменилисьДанные = Форма[ИмяРеквизита].Период <> Форма[ИмяРеквизита + "Прежняя"].Период;
	Если НЕ ИзменилисьДанные Тогда
		ИзменилисьДанные = ИзменилисьДанные ИЛИ 
		(ВедущийОбъект <> Форма[ИмяРеквизита + "Прежняя"][ИмяИзмерения] И 
		ЗначениеЗаполнено(Форма[ИмяРеквизита + "Прежняя"][ИмяИзмерения]));
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		ИзменилисьДанные = ИзменилисьДанные ИЛИ 
		(Форма[ИмяРеквизита].ВидДокумента <> Форма[ИмяРеквизита + "Прежняя"].ВидДокумента);
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		Для Каждого Поле Из МетаданныеРегистра.Ресурсы Цикл
			ИзменилисьДанные = ИзменилисьДанные ИЛИ (Форма[ИмяРеквизита][Поле.Имя] <> Форма[ИмяРеквизита + "Прежняя"][Поле.Имя]);
		КонецЦикла;
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		Для Каждого Поле Из МетаданныеРегистра.Реквизиты Цикл
			ИзменилисьДанные = ИзменилисьДанные ИЛИ (Форма[ИмяРеквизита][Поле.Имя] <> Форма[ИмяРеквизита + "Прежняя"][Поле.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	Если ИзменилисьДанные Тогда
		// пишем новое состояние записи
		МенеджерЗаписи = Форма.РеквизитФормыВЗначение(ИмяРеквизита);
		МенеджерЗаписи[ИмяИзмерения] = ВедущийОбъект;
		// если нужно сохранить старую запись, то установим режим замещения - Ложь
		Если Форма[ИмяРеквизита + "НоваяЗапись"] Тогда
			НоваяЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,  МенеджерЗаписи);
			НоваяЗапись.Записать();
		Иначе
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ЛИЧНЫМИ ДАННЫМИ ФИЗ ЛИЦА

// Процедура склоняет переданную фразу
// Параметры:
//  ФИО (обязательный), тип строка
//   Параметр должен содержать фамилию имя отчества в именительном падеже, которые необходимо просклонять.
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Результат (обязательный), тип строка
//   Переменная, в которую будет возвращен результат склонения.
//
//  ПолПеречислением (необязательный), тип Перечисление.ПолФизическогоЛица
//   Пол физического лица
//
Процедура Просклонять(Знач ФИО, Падеж, Результат, ПолПеречислением = Неопределено) Экспорт
	
	Пол = Неопределено;
	
	Если Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
			Пол = 1;
	ИначеЕсли Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский") Тогда
			Пол = 2;
	КонецЕсли;		

	Результат = СклонениеПредставленийОбъектов.ПросклонятьФИО(ФИО, Падеж, ,  Пол);
	
КонецПроцедуры

Процедура ПолучитьДанныеКонтрагента(Результат) Экспорт
	Справочники.Контрагенты.ПолучитьДанныеКонтрагента(Результат);
КонецПроцедуры

Функция ФИОФизлица(Объект, Период) Экспорт
	Возврат Справочники.ФизическиеЛица.ФИОФизлица(Объект, Период); 
КонецФункции

// Возвращает ФИО переданного субъекта
// См. также КорреспондентыКлиентСервер.ФИО
//
// Параметры:
//  Объект			 - СправочникСсылка.Сотрудник, СправочникСсылка.Контрагент - объект 
//						для которого определяется ФИО. ФИО берутся из регистра сведений;
//						если в регистре данных нет, то ФИО получается из наименования. 
//  ИОПередФамилией	 - Булево - Определяет место вывода Имени и Отчества. Если Истина,
//						то "Имя Отчество Фамилия" (И. О. Фамилия), иначе "Фамилия Имя Отчество" (Фамилия И.О.)
//  Период			 - Дата - если в качестве Объекта передана ссылка, то ФИО из регистра сведений
//						берутся на эту дату
//  ИОИнициалами	 - Булево - Если Истина, то Имя и Отчество выводятся сокращенно, в виде инициалов "И. О."
// Возвращаемое значение:
//   Приведенное ФИО
//
Функция ФИОПоОбъекту(Знач Объект, ИОПередФамилией = Ложь, Период = Неопределено, ИОИнициалами = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Или ТипЗнч(Объект) = Тип("СправочникСсылка.Сотрудники") Тогда
		//дети и студены - тоже надо
		Результат = Новый Структура("СсылкаНаОбъект,Фамилия,Имя,Отчество,НаименованиеПолное", Объект);
		Если Период <> Неопределено Тогда
			Результат.Вставить("Период", Период);
		КонецЕсли;
		ПолучитьДанныеКонтрагента(Результат);
		Если Не ЗначениеЗаполнено(Результат.Фамилия) // в регистре пусто, пробуем получить из наименования
			И Не ЗначениеЗаполнено(Результат.Имя)
			И Не ЗначениеЗаполнено(Результат.Отчество) Тогда
			Результат = Результат.НаименованиеПолное;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Результат = ФИОФизлица(Объект, Период);
	Иначе
		Результат = Объект;
	КонецЕсли;
	
	Возврат КорреспондентыКлиентСервер.ФИО(Результат, ИОПередФамилией, , ИОИнициалами);
	
КонецФункции

#КонецОбласти
